Revit 2024 API
FormatOptions.IsValidAccuracy Method (ForgeTypeId, Double)
 Checks whether an accuracy is valid for a given unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsValidAccuracy(
	ForgeTypeId unitTypeId,
	double accuracy
)
Visual Basic
Public Shared Function IsValidAccuracy ( _
	unitTypeId As ForgeTypeId, _
	accuracy As Double _
) As Boolean
Visual C++
public:
static bool IsValidAccuracy(
	ForgeTypeId^ unitTypeId,
	double accuracy
)
Parameters
unitTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 Identifier of the unit.
accuracy
Type: System.Double
 The accuracy to check.
Return Value
 True if the accuracy is valid, false otherwise.
Remarks
 See the Accuracy property for details on valid accuracy values.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitTypeId is not a unit identifier. See UnitUtils.IsUnit(ForgeTypeId) and UnitUtils.GetUnitTypeId(DisplayUnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FormatOptions Class
IsValidAccuracy Overload
Autodesk.Revit.DB Namespace